// Найдите произведение пар чисел в одномерном массиве. Парой считаем 
// первый и последний элемент, второй и предпоследний и т.д.
// Результат запишите в новом массиве.
// [1, 2, 3, 4, 5] -> 5 8 3
// [6, 7, 3, 6] -> 36 21


int[] array = new int[] { 4, 6, 5, 19, 6, 3, 7 };

var i = 0;
var j = array.Length - 1;
while (i <= j) {
    if (i != j) {
        Console.Write(array[i] * array[j] + " ");
    } else {
        Console.WriteLine(array[i]);
    }

    i += 1;
    j -= 1;
}



